/*
*********************************************************************************************************
*
*	模块名称 : main模块
*	文件名称 : main.h
*	版    本 : V1.0
*
*	Copyright (C), 2015-2016, 安富莱电子 www.armfly.com
*
*********************************************************************************************************
*/

#ifndef _MAIN_H_
#define _MAIN_H_

/* 主程序状态字定义, MS = Main Status */
enum
{
	MS_MAIN_RUN = 0,	/* 主界面 */
	
	MS_SYSTEM_SET,		/* 系统设置 */
		
	MS_RESERVED			/* 保留的功能状态 */
};

extern uint8_t g_MainStatus;	/* 状态机 */
#endif

/***************************** 安富莱电子 www.armfly.com (END OF FILE) *********************************/

