/*
*********************************************************************************************************
*
*	模块名称 : 主程序入口
*	文件名称 : main.c
*	版    本 : V1.0
*	说    明 : 
*	修改记录 :
*		版本号  日期       作者    说明
*		
*
*	Copyright (C), 2015-2016, xxxxxxxx
*
*********************************************************************************************************
*/

#include "bsp.h"				/* 底层硬件驱动 */
#include "param.h"
#include "main.h"
#include "main_run.h"
#include "system_set.h"
/* 仅允许本文件内调用的函数声明 */
static void PrintfLogo(void);

	
uint8_t g_MainStatus = 0;	/* 状态机 */

/*
*********************************************************************************************************
*	函 数 名: main
*	功能说明: c程序入口
*	形    参：无
*	返 回 值: 错误代码(无需处理)
*********************************************************************************************************
*/
int main(void)
{

	
	bsp_Init();		/* 硬件初始化 */
	PrintfLogo();	/* 打印例程Logo到串口0 */
	LoadParam();	/* 读取应用程序参数, 该函数在param.c */
	
	/* 主程序采用状态机实现程序功能切换 */
	g_MainStatus = MS_MAIN_RUN;	/* 初始状态 = 图标界面 */
	/* 状态机大循环 */
	while (1)
	{
		switch (g_MainStatus)
		{
			case MS_MAIN_RUN:
				Main_Run();		/* 主界面状态 */
				break;
			case MS_SYSTEM_SET:
				System_Set();	/* 系统设置 */
				break;
			default:
				g_MainStatus = MS_MAIN_RUN;
				break;
		}
	}
}
/*
*********************************************************************************************************
*	函 数 名: PrintfLogo
*	功能说明: 打印例程名称和例程发布日期, 接上串口线后，打开PC机的超级终端软件可以观察结果
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
static void PrintfLogo(void)
{
	printf("+-----------------------------------------------------------+\n");
    printf("|                                                           |\n");
    printf("+-----------------------------------------------------------+\n");
    printf("|  Description :                                            |\n");
    printf("|                                                           |\n");
    printf("|                                                           |\n");
    printf("+-----------------------------------------------------------+\n");
}


